Autodesk.Revit.DB.SiteLocation.CreateForLink(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String)
Create a GeoSite for the specific LinkType, if the type has one already, we delete the old GeoSite first
document:
The document of the link.
linkTypeId:
The ElementId of the link where the new instance of SiteLocation would be created in.
geoSiteName:
The name of the instance of SiteLocation to be created.
geoCoordinateSystem:
The coordinate system
Returns:
The newly created instance of SiteLocation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element linkTypeId does not exist in the document
-or-
geoSiteName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.SiteLocation.GetCoordinateUnitScale
Get Unit Scale of Coordinates
Since:
2018

Autodesk.Revit.DB.SiteLocation.GetCoordinateEpsgCode
Get Epsg Code of Coordinates
Since:
2018

Autodesk.Revit.DB.SiteLocation.GetCoordinateDescription
Get the description of Coordinates
Since:
2018

Autodesk.Revit.DB.SiteLocation.IsCompatibleWith(Autodesk.Revit.DB.SiteLocation)
Checks whether the geographic coordinate system of this site is compatible with the given site .
True if he geographic coordinate system of this site is compatible with the given site, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.SiteLocation.SetGeoCoordinateSystem(System.String)
Set the geographic coordinate system for this site. Similar to acquire coordinate system from a link in the UI.
Remarks:
The ID, WKT or Autodesk coordinate system xml representation of the coordinate reference system definition.
The xml representation is the same format get via RealDWG's API - AcDbGeoData::coordinateSystem.
Optionally, the string can be prefixed by the ID's namespace and a colon (:) where the following are supported: ADSK, EPSG.
If no namespace has been specified, the ID is assumed to be a default Autodesk coordinate system identifier.
If no definition exists with such a code and if it consists of numbers only, the ID string is considered an EPSG code.
Valid examples are:
LL84 > Autodesk identifier (default)ADSK:LL84 > Autodesk identifierEPSG:4326 > EPSG identifier4326 > EPSG identifierGEOGCS["WGS 84", DATUM["WGS_1984", SPHEROID[...]]] > WKT
coordSystem:
The coordinate system to set for the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
coordSystem is an empty string or contains only whitespace.
-or-
The coordinate system is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InternalException:
Fail to update coordinate system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The site location does not come from the project.
Since:
2019.2

Autodesk.Revit.DB.SiteLocation.GeoCoordinateSystemDefinition
The XML string which describes the geographic coordinate system.
Remarks:
If the site does not have a geographic coordinate system, it returns an empty string for this property.
Since:
2018

Autodesk.Revit.DB.SiteLocation.GeoCoordinateSystemId
The geographic coordinate system ID, such as "AMG-50" and "Beijing1954/a.GK3d-40".
Remarks:
If the site does not have a geographic coordinate system, it returns an empty string for this property.
Since:
2018

Autodesk.Revit.DB.SiteLocation.Elevation
The elevation of the site location.
Since:
2014 UR2

Autodesk.Revit.DB.SiteLocation.WeatherStationName
The name of the weather station at the site location.
Since:
2014 UR2

Autodesk.Revit.DB.SiteLocation.PlaceName
The place name of the site.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SiteLocation.TimeZone
The time-zone for the site.
Remarks:
Remarks:
A property that returns the time zone in which the site resides.
The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.
If the input value is not in the valid range, it will be shifted by multiples
of 24 until it is in range.
Set this property directly if for your desired latitude and longitude, Revit's calculation
does not match with the actual time zone for your location.  Note that there are no restrictions
preventing you from setting this to an incorrect value for the site location, and incorrect
times for Solar Studies may result.
Hours ranging from -12 to +12. 0 represents GMT. Note that if the input value is
not in the valid range, it will be shifted by multiples of 24 until it is in range.

Autodesk.Revit.DB.SiteLocation.Longitude
The longitude of the site location.
Remarks:
A property that contains the longitude of the site location.
The value of this property is in radians between +PI and -PI. If the given value is
not between -PI and PI, it will be shifted by multiples of 2PI until it is in range.
When setting this property:
Revit will attempt to match the coordinates to a city it knows about, and if a match is found, will set the
name accordingly.Revit will attempt to automatically adjust the time zone value to match the new Longitude value set using
Autodesk::Revit::DB::SunAndShadowSettings::CalculateTimeZone. For some boundary
cases, the time zone calculated may not be correct.  You can set the Autodesk.Revit.DB.SiteLocation.TimeZone property directly to the correct
value if necessary.
Revit will attempt to automatically update the weather station associated with the coordinates.
The longitude, in radians between -PI and PI. If the value is not
between -PI and PI, it will be shifted by multiples of 2PI until
it is in range.

Autodesk.Revit.DB.SiteLocation.Latitude
The latitude of the site location.
Remarks:
A property that contains the latitude of the site location.
The value of this property is in radians between +PI/2 and -PI/2.
When setting this property:
Revit will attempt to match the coordinates to a city it knows about, and if a match is found, will set the
name accordingly.Revit will attempt to automatically adjust the time zone value to match the new Latitude value set using
Autodesk::Revit::DB::SunAndShadowSettings::CalculateTimeZone. For some boundary
cases, the time zone calculated may not be correct.  You can set the Autodesk.Revit.DB.SiteLocation.TimeZone property directly to the
correct value if necessary.
Revit will attempt to automatically update the weather station associated with the location's coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The latitude value is out of range. It must be between -PI/2 and PI/2.

Autodesk.Revit.DB.SiteLocation.ConvertFromProjectTime(System.DateTime)
Converts project time to UTC time.
Remarks: Daylight savings time is not considered during this conversion.
projectTime: The project time.
Returns the UTC time.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the projectTime's kind is not Unspecified.

Autodesk.Revit.DB.SiteLocation.ConvertToProjectTime(System.DateTime)
Converts local time or UTC time to project time.
Remarks: Daylight savings time is not considered during this conversion.
inputTime: The input local time or UTC time.
Returns the project time of Unspecified kind.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the inputTime's kind is neither Local nor Utc.

Autodesk.Revit.DB.SiteLocation
Contains the geographical location information for the project's site.
Remarks:
Each project may have one site which dictates where in the world the project is
based. On this site there may be several locations of the same project. These are represented
by ProjectLocation objects. The site location object can be found by using the SiteLocation property
on the Document object. The properties of this object can be changed such that it represents any
location on the planet or to a known city. Cities already programmed into Revit can be found
from the Cities property on the Application object.